AUTO_config_TK_pesok/src/Catalogs/СкладыКомпании/СкладыКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СкладыКомпании</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение компании, к которому относится склад компании</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенСебестоимости</name>
    <comment>Тип цен из которых считается себестоимость когда не найдены партии при возвратах и прочих оприходованиях</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенРозничнойТорговли</name>
    <comment>Тип цен розничной торговли (для розничного склада)</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Розничный</name>
    <comment>Истина - склад розничный, иначе - оптовый</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСклада</name>
    <type>
      <types>CatalogRef.ВидыСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Районы</name>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВестиУчетПоХарактеристикам</name>
    <comment>Устаревший, использовать вместо регистр &quot;ТК_УчетХарактеристикНаСкладах&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Global_ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаДоставки</name>
    <comment>(АСУ by 4ок)</comment>
    <type>
      <types>CatalogRef.ТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <comment>Номер маршрута доставки (0 если склад не торгует)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АссортиментнаяМатрица</name>
    <type>
      <types>CatalogRef.АссортиментнаяМатрица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриторияПоКОАТУУ</name>
    <comment>Название и код территории по КОАТУУ, на которой расположен склад (торговая точка)</comment>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
  <attributes>
    <name>НеАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСкладТорговойПлощадки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийСклад</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Автомата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАвтомата</name>
    <type>
      <types>CatalogRef.ВидыВендингАвтоматов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеЦены</name>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_УчетнаяПолитикаТорговыхПлощадок/ТК_УчетнаяПолитикаТорговыхПлощадок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_УчетнаяПолитикаТорговыхПлощадок</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_УчетХарактеристикНаСкладах/ТК_УчетХарактеристикНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_УчетХарактеристикНаСкладах</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НеВестиУчетПоХарактеристикам</name>
    <comment>Не вести учет по характеристикам на данном складе</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/Catalogs/ТорговыеПлощадки/ТорговыеПлощадки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТорговыеПлощадки</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Global_ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьТоварыПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияОС_ТекущиеОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриторияПоКОАТУУ</name>
    <comment>Название и код территории по КОАТУУ, на которой расположен торговая точка</comment>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <comment>Номер маршрута доставки (0 если не торгует)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АссортиментнаяМатрица</name>
    <type>
      <types>CatalogRef.АссортиментнаяМатрица</types>
    </type>
  </attributes>
  <attributes>
    <name>АлкоголемНеТоргуем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешительныеДокументы</name>
    <comment>Наличие разрешительных документов по ПБ</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСистемаАПС</name>
    <comment>Договор на обслуживание системы АПС</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Потребители</name>
    <comment>Потребители коммунальных услуг</comment>
    <attributes>
      <name>Потребитель</name>
      <comment>Потребитель коммунальных услуг</comment>
      <type>
        <types>DefinedType.ПотребительКоммунальныхУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РекламныеПлоскости</name>
    <attributes>
      <name>Расположение</name>
      <type>
        <types>EnumRef.ПлоскостьПодРекламу</types>
      </type>
    </attributes>
    <attributes>
      <name>РекламныйНоситель</name>
      <type>
        <types>CatalogRef.РекламныеНосители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сюжет</name>
      <type>
        <types>CatalogRef.СюжетыРекламныхНосителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборудованиеПоставщиков</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ОборудованиеПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНапитков</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Чай</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IMEI_1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IMEI_2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДверей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУстановки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВывоза</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Огнетушители</name>
    <attributes>
      <name>Огнетушитель</name>
      <type>
        <types>EnumRef.ТипыОгнетушителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСледующегоТО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/СкладыКомпании/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ВЫБОР
	|		КОГДА ЭтоГруппа
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ 
	|			ЗначениеРазрешено(Подразделение)
	|			И ЗначениеРазрешено(ТорговаяПлощадка)
	|	КОНЕЦ";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	БлокируемыеРеквизиты.Добавить("Код");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов


#КонецОбласти


Функция ПолучитьСкладПоКлючуФоновогоЗадания(КлючФоновогоЗадания) Экспорт

	ПозицияРазделителя = Найти(КлючФоновогоЗадания, "UID#");
	
	УникальныйИдентификаторСклада = Сред(КлючФоновогоЗадания, ПозицияРазделителя + 4);
	
	Возврат Справочники.СкладыКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор(УникальныйИдентификаторСклада));

КонецФункции // ПолучитьСкладПоКлючуФоновогоЗадания()

Функция ПолучитьКлючФоновогоЗаданияПоСкладу(Склад) Экспорт

	Возврат СокрЛП(Склад.Наименование) + ", UID#" + Склад.УникальныйИдентификатор();	

КонецФункции // ПолучитьКлючФоновогоЗаданияПоСкладу()

Функция ТипЦенСебестоимости(СкладыКомпании) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Склады.ТипЦенСебестоимости
	|ИЗ
	|	Справочник.СкладыКомпании КАК Склады
	|ГДЕ
	|	Склады.Ссылка = &СкладыКомпании";
	Запрос.УстановитьПараметр("СкладыКомпании", СкладыКомпании);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТипЦены = Выборка.ТипЦенСебестоимости;
	Иначе
		ТипЦены = ПредопределенноеЗначение("Справочник.ТипыЦен.ПустаяСсылка");
	КонецЕсли;
	
	Возврат ТипЦены;
КонецФункции

Функция ТипЦенРозничный(СкладыКомпании) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Склады.ТипЦенРозничнойТорговли КАК ТипЦенРозничнойТорговли
	|ИЗ
	|	Справочник.СкладыКомпании КАК Склады
	|ГДЕ
	|	Склады.Ссылка = &СкладыКомпании";
	Запрос.УстановитьПараметр("СкладыКомпании", СкладыКомпании);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТипЦены = Выборка.ТипЦенРозничнойТорговли;
	Иначе
		ТипЦены = ПредопределенноеЗначение("Справочник.ТипыЦен.ПустаяСсылка");
	КонецЕсли;
	
	Возврат ТипЦены;	
КонецФункции

Функция ТорговаяПлощадкаСклада(СкладыКомпании) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Склады.ТорговаяПлощадка
	|ИЗ
	|	Справочник.СкладыКомпании КАК Склады
	|ГДЕ
	|	Склады.Ссылка = &СкладыКомпании";
	Запрос.УстановитьПараметр("СкладыКомпании", СкладыКомпании);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТорговаяПлощадка = Выборка.ТорговаяПлощадка;
	Иначе
		ТорговаяПлощадка = ПредопределенноеЗначение("Справочник.ТорговыеПлощадки.ПустаяСсылка");
	КонецЕсли;
	
	Возврат ТорговаяПлощадка;
КонецФункции

Функция ОсновнойСкладТорговойПлощадки(ТорговаяПлощадка)Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СкладыКомпании.Ссылка КАК СкладСсылка,
		|	ВЫБОР
		|		КОГДА СкладыКомпании.ПометкаУдаления
		|			ТОГДА 9
		|		КОГДА СкладыКомпании.НеАктивен
		|			ТОГДА 8
		|		КОГДА СкладыКомпании.ОсновнойСкладТорговойПлощадки
		|			ТОГДА 0
		|		КОГДА СкладыКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйЗал)
		|			ТОГДА 1
		|		КОГДА СкладыКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйПавильон)
		|			ТОГДА 2
		|		КОГДА СкладыКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ОсновнойСклад)
		|			ТОГДА 3
		|		ИНАЧЕ 4
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	СкладыКомпании.ТорговаяПлощадка = &ТорговаяПлощадка
		|	И НЕ СкладыКомпании.ПометкаУдаления
		|	И НЕ СкладыКомпании.НеАктивен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.СкладыКомпании.ПустаяСсылка();
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий(); 
	СкладСсылка = ВыборкаДетальныеЗаписи.СкладСсылка;
	
	Возврат СкладСсылка;
	
	
КонецФункции

Функция ТНПСкладТорговойПлощадки(ТорговаяПлощадка)Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СкладыКомпании.Ссылка КАК СкладСсылка
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	СкладыКомпании.ТорговаяПлощадка = &ТорговаяПлощадка
		|	И НЕ СкладыКомпании.ПометкаУдаления
		|	И НЕ СкладыКомпании.НеАктивен
		|	И СкладыКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТНП)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	СкладыКомпании.Ссылка
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	СкладыКомпании.ТорговаяПлощадка = &ТорговаяПлощадка
		|	И НЕ СкладыКомпании.ПометкаУдаления
		|	И НЕ СкладыКомпании.НеАктивен
		|	И СкладыКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ОсновнойСклад)";
	
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.СкладыКомпании.ПустаяСсылка();
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий(); 
	СкладСсылка = ВыборкаДетальныеЗаписи.СкладСсылка;
	
	Возврат СкладСсылка;
	
	
КонецФункции

Функция НайтиТорговуюПлощадкуСкладаПоGLN(GLN)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СкладыКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|	ВЫБОР
		|		КОГДА СкладыКомпании.ПометкаУдаления
		|			ТОГДА 5
		|		КОГДА СкладыКомпании.ОсновнойСкладТорговойПлощадки
		|			ТОГДА 0
		|		КОГДА СкладыКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйЗал)
		|			ТОГДА 1
		|		КОГДА СкладыКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйПавильон)
		|			ТОГДА 2
		|		КОГДА СкладыКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ОсновнойСклад)
		|			ТОГДА 3
		|		ИНАЧЕ 4
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	НЕ СкладыКомпании.ПометкаУдаления
		|	И НЕ СкладыКомпании.НеАктивен
		|	И СкладыКомпании.ТочкаДоставки.GLN = &GLN
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	Запрос.УстановитьПараметр("GLN", GLN);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий(); 
	ТорговаяПлощадкаСсылка = ВыборкаДетальныеЗаписи.ТорговаяПлощадка;
	
	Возврат ТорговаяПлощадкаСсылка;

КонецФункции

Функция ОсновнойСкладТорговойПлощадкиGLN(ТорговаяПлощадка,GLN)Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СкладыКомпании.Ссылка КАК СкладСсылка,
		|	ВЫБОР
		|		КОГДА СкладыКомпании.ПометкаУдаления
		|			ТОГДА 5
		|		КОГДА СкладыКомпании.ОсновнойСкладТорговойПлощадки
		|			ТОГДА 0
		|		КОГДА СкладыКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйЗал)
		|			ТОГДА 1
		|		КОГДА СкладыКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйПавильон)
		|			ТОГДА 2
		|		КОГДА СкладыКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ОсновнойСклад)
		|			ТОГДА 3
		|		ИНАЧЕ 4
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	СкладыКомпании.ТорговаяПлощадка = &ТорговаяПлощадка
		|	И НЕ СкладыКомпании.ПометкаУдаления
		|	И НЕ СкладыКомпании.НеАктивен
		|	И СкладыКомпании.ТочкаДоставки.GLN = &GLN
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	Запрос.УстановитьПараметр("GLN", GLN);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.СкладыКомпании.ПустаяСсылка();
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий(); 
	СкладСсылка = ВыборкаДетальныеЗаписи.СкладСсылка;
	
	Возврат СкладСсылка;
	
	
КонецФункции

Функция ПолучитьСкладПоТочкеДоставки(ТочкаДоставки) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СкладыКомпании.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СкладыКомпании КАК СкладыКомпании
	               |ГДЕ
	               |	СкладыКомпании.ТочкаДоставки = &ТочкаДоставки
	               |	И НЕ СкладыКомпании.ЭтоГруппа
	               |	И НЕ СкладыКомпании.ПометкаУдаления
	               |	И НЕ СкладыКомпании.НеАктивен";
	
	Запрос.УстановитьПараметр("ТочкаДоставки", ТочкаДоставки);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда 
		СкладСсылка = Выборка.Ссылка;
	Иначе
		СкладСсылка = Справочники.СкладыКомпании.ПустаяСсылка();	
	КонецЕсли;
	
	Возврат СкладСсылка;
	
КонецФункции


Функция ОрганизацияСклада(СкладыКомпании, НаДату = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация КАК Организация
	               |ИЗ
	               |	РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&НаДату, ТорговаяПлощадка = ВЫРАЗИТЬ(&СкладыКомпании КАК Справочник.СкладыКомпании).ТорговаяПлощадка) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних";
	
	Запрос.УстановитьПараметр("СкладыКомпании", СкладыКомпании);
	Запрос.УстановитьПараметр("НаДату", ?(НаДату <> Неопределено, НаДату, Неопределено));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Организация = Выборка.Организация;
	Иначе 
		Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
	КонецЕсли;
	
	Возврат Организация;
КонецФункции

Функция НеВестиУчетПоХарактеристикамНаСкладе(СкладКомпании, НаДату = Неопределено) Экспорт 
	
	НеВестиУчетПоХарактеристикам = Ложь;
	
	Если Не ЗначениеЗаполнено(НаДату) Тогда 
		НаДату = ТекущаяДата();
	КонецЕсли;		
	
	ТаблицаУчета = ЗначениеНастроекПовтИсп.ПолучитьТаблицуУчетаХарактеристик(СкладКомпании);
	
	Если ТаблицаУчета.Количество() = 0 Тогда 
		Возврат НеВестиУчетПоХарактеристикам;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаУчета", ТаблицаУчета);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.Текст = "ВЫБРАТЬ
	               |	втУчетХарактеристик.Период КАК Период,
	               |	втУчетХарактеристик.НеВестиУчетПоХарактеристикам КАК НеВестиУчетПоХарактеристикам
	               |ПОМЕСТИТЬ втУчетХарактеристик
	               |ИЗ
	               |	&ТаблицаУчета КАК втУчетХарактеристик
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	втУчетХарактеристик.Период КАК Период,
	               |	втУчетХарактеристик.НеВестиУчетПоХарактеристикам КАК НеВестиУчетПоХарактеристикам
	               |ИЗ
	               |	втУчетХарактеристик КАК втУчетХарактеристик
	               |ГДЕ
	               |	втУчетХарактеристик.Период <= &НаДату
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		НеВестиУчетПоХарактеристикам = Выборка.НеВестиУчетПоХарактеристикам;
	КонецЕсли;
	
	Возврат НеВестиУчетПоХарактеристикам;
	
КонецФункции


Функция ПолучитьТаблицуУчетаХарактеристик(СкладКомпании) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);	
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаРезультат.Колонки.Добавить("НеВестиУчетПоХарактеристикам", Новый ОписаниеТипов("Булево"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТК_УчетХарактеристикНаСкладах.Период КАК Период,
	               |	ТК_УчетХарактеристикНаСкладах.НеВестиУчетПоХарактеристикам КАК НеВестиУчетПоХарактеристикам
	               |ИЗ
	               |	РегистрСведений.ТК_УчетХарактеристикНаСкладах КАК ТК_УчетХарактеристикНаСкладах
	               |ГДЕ
	               |	ТК_УчетХарактеристикНаСкладах.СкладКомпании = &СкладКомпании";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция МассивСкладовТорговойПлощадки(ТорговаяПлощадка)Экспорт
	
	МассивСкладов = Новый Массив;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладыКомпании.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	СкладыКомпании.ТорговаяПлощадка = &ТорговаяПлощадка
		|	И СкладыКомпании.ЭтоГруппа = ЛОЖЬ
		|	И СкладыКомпании.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МассивСкладов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		
	КонецЦикла;
	

	Возврат МассивСкладов;
	
КонецФункции


Функция МассивСкладовТорговойПлощадкиТСД(ТорговаяПлощадка)Экспорт
	
	МассивОтвет = Новый Массив;
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладыКомпании.Ссылка КАК СкладСсылка,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СкладыКомпании.Ссылка) КАК СкладНаименование,
		|	ВЫБОР
		|		КОГДА СкладыКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТНП)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ТНП
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	СкладыКомпании.ЭтоГруппа = ЛОЖЬ
		|	И СкладыКомпании.ПометкаУдаления = ЛОЖЬ
		|	И СкладыКомпании.ТорговаяПлощадка = &ТорговаяПлощадка
		|	И СкладыКомпании.НеАктивен = ЛОЖЬ
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		СтуктураСклада = Новый Структура("Склад,СкладUUID,ТНП", ВыборкаДетальныеЗаписи.СкладНаименование,Строка(ВыборкаДетальныеЗаписи.СкладСсылка.УникальныйИдентификатор()),ВыборкаДетальныеЗаписи.ТНП);
		МассивОтвет.Добавить(СтуктураСклада);
	КонецЦикла;
	
	Возврат МассивОтвет;
	
КонецФункции

Функция ЭтоСкладТНП(СкладСсылка)Экспорт
	Возврат СкладСсылка.ВидСклада = Справочники.ВидыСкладов.ТНП;	
КонецФункции


Функция МассивСкладовПоПодразделению(Подразделение)	Экспорт
	
	МассивСкладов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладыКомпании.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	СкладыКомпании.Подразделение В(&Подразделение)
		|	И СкладыКомпании.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МассивСкладов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		
	КонецЦикла;

	Возврат МассивСкладов;
	
КонецФункции

Функция СкладUUID(СкладКомпании)Экспорт
	
	Возврат Строка(СкладКомпании.УникальныйИдентификатор());	
	
КонецФункции


#КонецОбласти

#КонецЕсли
